<a href="https://colab.research.google.com/github/sergioneto12/DE_Carrefour_Data_Science_Class/blob/master/DECarrefour_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [ ]:
##Lendo o banco de dados

In [ ]:
dados = pd.read_csv("/content/train_and_test2.csv")

dados.head()

   Passengerid   Age     Fare  Sex  ...  Embarked  zero.17  zero.18  2urvived
0            1  22.0   7.2500    0  ...       2.0        0        0         0
1            2  38.0  71.2833    1  ...       0.0        0        0         1
2            3  26.0   7.9250    1  ...       2.0        0        0         1
3            4  35.0  53.1000    1  ...       2.0        0        0         1
4            5  35.0   8.0500    0  ...       2.0        0        0         0

[5 rows x 28 columns]

In [ ]:
dados.columns

Index(['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'Pclass', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18', '2urvived'],
      dtype='object')

In [ ]:
dados = dados.drop(['sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18'], axis=1)

In [ ]:
dados = dados.set_index(['Passengerid'])
dados = dados.rename(columns={'Survived': 'target'}, inplace=False)

In [ ]:
dados.head()

              Age     Fare  Sex  Pclass  2urvived
Passengerid
1            22.0   7.2500    0       3         0
2            38.0  71.2833    1       1         1
3            26.0   7.9250    1       3         1
4            35.0  53.1000    1       1         1
5            35.0   8.0500    0       3         0

In [ ]:
dados.describe()

               Age         Fare          Sex       Pclass     2urvived
count  1309.000000  1309.000000  1309.000000  1309.000000  1309.000000
mean     29.503186    33.281086     0.355997     2.294882     0.261268
std      12.905241    51.741500     0.478997     0.837836     0.439494
min       0.170000     0.000000     0.000000     1.000000     0.000000
25%      22.000000     7.895800     0.000000     2.000000     0.000000
50%      28.000000    14.454200     0.000000     3.000000     0.000000
75%      35.000000    31.275000     1.000000     3.000000     1.000000
max      80.000000   512.329200     1.000000     3.000000     1.000000